cf/InformationRegisters/СведенияОСтавкахЕСНиПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СведенияОСтавкахЕСНиПФР</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДоходаС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоходаПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФедеральныйБюджетВПроцентах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФССвПроцентах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФФОМСвПроцентах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТФОМСвПроцентах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРНакопительная1вПроцентах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРНакопительная2вПроцентах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРСтраховая1вПроцентах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРСтраховая2вПроцентах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФедеральныйБюджетВРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФССвРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФФОМСвРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТФОМСвРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРНакопительная1вРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРНакопительная2вРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРСтраховая1вРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПФРСтраховая2вРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСтавокЕСНиПФР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокЕСНиПФР</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/ВидыСтавокЕСНиПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСтавокЕСНиПФР</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДляСельскохозяйственныхПроизводителей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляНеСельскохозяйственныхПроизводителей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/InformationRegisters/СведенияОСтавкахЕСНиПФР/Ext/RecordSetModule.bsl
// предопределенная процедура проверяет логическую 
// связанность введенных данных
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не Отбор.Год.Использование 
		Или Не Отбор.ВидСтавокЕСНиПФР.Использование 
		Или Отбор.Год.ВидСравнения <> ВидСравнения.Равно 
		Или Отбор.ВидСтавокЕСНиПФР.ВидСравнения <> ВидСравнения.Равно Тогда
		Возврат;
	КонецЕсли;
	
	// проверяем набор записей
	Год = Отбор.Год.Значение;
	ВидСтавокЕСНиПФР = Отбор.ВидСтавокЕСНиПФР.Значение;
	ВременнаяТЗ = ЭтотОбъект.Выгрузить();
	ВременнаяТЗ.Сортировать("НомерСтрокиСтавок");
	
	Если ВременнаяТЗ.Количество() = 0 или ВременнаяТЗ.Количество() <> ВременнаяТЗ[Количество()-1].НомерСтрокиСтавок Или ВременнаяТЗ[0].НомерСтрокиСтавок <> 1 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("В сведениях о ставках ЕСН обнаружены ошибки. Сведения не записаны!",Отказ);
		ОбщегоНазначения.СообщитьОбОшибке(Символы.Таб + "Неверно пронумерованы строки ставок",Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	Ошибки = Новый Массив;
	ПредыдущийПредел = 0;
	ПредыдущаяСтрока = Неопределено;	
	Для Каждого СтрокаТЗ Из ВременнаяТЗ Цикл
		
		Индекс = ВременнаяТЗ.Индекс(СтрокаТЗ);
		
		СтрокаТЗ.Год = Год;
		СтрокаТЗ.ВидСтавокЕСНиПФР = ВидСтавокЕСНиПФР;
		
		Если Индекс = 0 И СтрокаТЗ.СуммаДоходаС <> 0 Тогда
			Ошибки.Добавить("Нижний предел по первой строке должен быть нулевым");
		КонецЕсли;
		Если ПредыдущийПредел <> СтрокаТЗ.СуммаДоходаС Тогда
			Ошибки.Добавить("В строке "+СтрокаТЗ.НомерСтрокиСтавок+" нижний передел не совпадает с верхним переделом предыдущей строки");
		КонецЕсли;
		Если СтрокаТЗ.СуммаДоходаС >= СтрокаТЗ.СуммаДоходаПо Тогда
			Ошибки.Добавить("В строке "+СтрокаТЗ.НомерСтрокиСтавок+" верхний предел должен быть больше нижнего");
		КонецЕсли;
		
		// Расчет суммы фиксированной ставки в рублях от процентов предыдущего предела
		Если Индекс <> 0 Тогда
			
			СтрокаТЗ.ФедеральныйБюджетВРублях = ПредыдущаяСтрока.ФедеральныйБюджетВРублях + (ПредыдущаяСтрока.СуммаДоходаПо - ПредыдущаяСтрока.СуммаДоходаС) * ПредыдущаяСтрока.ФедеральныйБюджетВПроцентах / 100;				
			СтрокаТЗ.ФССВРублях 			= ПредыдущаяСтрока.ФССвРублях 				+ (ПредыдущаяСтрока.СуммаДоходаПо - ПредыдущаяСтрока.СуммаДоходаС) * ПредыдущаяСтрока.ФССвПроцентах / 100;				
			СтрокаТЗ.ФФОМСВРублях 			= ПредыдущаяСтрока.ФФОМСвРублях 			+ (ПредыдущаяСтрока.СуммаДоходаПо - ПредыдущаяСтрока.СуммаДоходаС) * ПредыдущаяСтрока.ФФОМСвПроцентах / 100;				
			СтрокаТЗ.ТФОМСВРублях 			= ПредыдущаяСтрока.ТФОМСвРублях 			+ (ПредыдущаяСтрока.СуммаДоходаПо - ПредыдущаяСтрока.СуммаДоходаС) * ПредыдущаяСтрока.ТФОМСвПроцентах / 100;				
			СтрокаТЗ.ПФРНакопительная1ВРублях = ПредыдущаяСтрока.ПФРНакопительная1вРублях + (ПредыдущаяСтрока.СуммаДоходаПо - ПредыдущаяСтрока.СуммаДоходаС) * ПредыдущаяСтрока.ПФРНакопительная1вПроцентах / 100;				
			СтрокаТЗ.ПФРНакопительная2ВРублях = ПредыдущаяСтрока.ПФРНакопительная2вРублях + (ПредыдущаяСтрока.СуммаДоходаПо - ПредыдущаяСтрока.СуммаДоходаС) * ПредыдущаяСтрока.ПФРНакопительная2вПроцентах / 100;				
			СтрокаТЗ.ПФРСтраховая1ВРублях 	= ПредыдущаяСтрока.ПФРСтраховая1вРублях 	+ (ПредыдущаяСтрока.СуммаДоходаПо - ПредыдущаяСтрока.СуммаДоходаС) * ПредыдущаяСтрока.ПФРСтраховая1вПроцентах / 100;				
			СтрокаТЗ.ПФРСтраховая2ВРублях 	= ПредыдущаяСтрока.ПФРСтраховая2вРублях 	+ (ПредыдущаяСтрока.СуммаДоходаПо - ПредыдущаяСтрока.СуммаДоходаС) * ПредыдущаяСтрока.ПФРСтраховая2вПроцентах / 100;				
			
		КонецЕсли; 
		
		// запомним для следующей итерации
		ПредыдущийПредел = СтрокаТЗ.СуммаДоходаПо;
		ПредыдущаяСтрока = СтрокаТЗ;
		
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("В сведениях о ставках ЕСН обнаружены ошибки. Сведения не записаны!",Отказ);
		Для Каждого Строка Из Ошибки Цикл
			ОбщегоНазначения.СообщитьОбОшибке(Символы.Таб + Строка,Отказ);
		КонецЦикла;
	Иначе
		ЭтотОбъект.Загрузить(ВременнаяТЗ)
	КонецЕсли;
	
КонецПроцедуры

// Добавляет запись в набор записей регистра "СведенияОСтавкахЕСНиПФР" 
//
Процедура ДобавитьЗначенияСтавокЕСН(НаборЗаписей, Год, ВидСтавокЕСНиПФР, НомерСтрокиСтавок, СуммаДоходаС, СуммаДоходаПо, 
	                                ФедеральныйБюджет = 0, ФСС = 0 , ФФОМС = 0, ТФОМС = 0, 
	                                ПФРНакопительная1 = 0, ПФРНакопительная2 = 0,
	                                ПФРСтраховая1 = 0, ПФРСтраховая2 = 0)

	НоваяЗапись = НаборЗаписей.Добавить();

	НоваяЗапись.Год				  = Год;
	НоваяЗапись.ВидСтавокЕСНиПФР  = ВидСтавокЕСНиПФР;
	НоваяЗапись.НомерСтрокиСтавок = НомерСтрокиСтавок;
	НоваяЗапись.СуммаДоходаС      = СуммаДоходаС;
	НоваяЗапись.СуммаДоходаПо     = СуммаДоходаПо;
	НоваяЗапись.ФССВПроцентах     = ФСС;
	НоваяЗапись.ФФОМСВПроцентах   = ФФОМС;
	НоваяЗапись.ТФОМСВПроцентах   = ТФОМС;
	НоваяЗапись.ФедеральныйБюджетВПроцентах = ФедеральныйБюджет;
	НоваяЗапись.ПФРНакопительная1ВПроцентах = ПФРНакопительная1;
	НоваяЗапись.ПФРНакопительная2ВПроцентах = ПФРНакопительная2;
	НоваяЗапись.ПФРСтраховая1ВПроцентах     = ПФРСтраховая1;
	НоваяЗапись.ПФРСтраховая2ВПроцентах     = ПФРСтраховая2;

КонецПроцедуры

// Процедура вызывается из обработки обновления ИБ для первоначального заполнения ставок ЕСН и ПФР или
// из формы набора записей, для заполнения набора значениями по умолчанию
Процедура ЗаполнитьСведенияОСтавкахЕСНиПФР(ВидыСтавок = Неопределено, Год = Неопределено, РегистрСведенийНаборЗаписей = Неопределено, ЗадаватьВопрос = Истина) Экспорт
	
	ЗаполнитьВсе = РегистрСведенийНаборЗаписей = Неопределено;
	
	Если Не ЗаполнитьВсе и (Год > 2010 или Год < 2005) Тогда
		
		ТекстСообщения = "Нет данных о ставках ЕСН и ПФР на " + Формат(Год, "ЧГ=") + " год.";
		
		#Если Клиент Тогда
			
			Предупреждение(ТекстСообщения);
			
		#Иначе
			
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
			
		#КонецЕсли
		
		Возврат;
		
	КонецЕсли;	
	
	Если ЗаполнитьВсе Тогда
		
		НаборЗаписей = РегистрыСведений.СведенияОСтавкахЕСНиПФР.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВидСтавокЕСНиПФР.Использование = Истина;
		НаборЗаписей.Отбор.Год.Использование = Истина;
		
	Иначе
		Если ЗадаватьВопрос Тогда              
			#Если Клиент Тогда
				ТекстВопроса= "Перед заполнением текущие значения ставок шкалы " + НРег(Отбор.ВидСтавокЕСНиПФР.Значение) + " на " + Формат(Год, "ЧГ=") + " год будут очищены. Заполнить?";
				Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да) = КодВозвратаДиалога.Нет Тогда
					Возврат;	
				КонецЕсли;
			#КонецЕсли
		КонецЕсли;
		//заполняем переданный набор записей
		НаборЗаписей = РегистрСведенийНаборЗаписей;
		
	КонецЕсли;	
	
	
	// ----------------------------------------------------------------------------
	// 2005 год
	
	Если ЗаполнитьВсе или (Год = 2005 и ВидыСтавок = Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей) Тогда
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Отбор.Год.Значение = 2005;
			НаборЗаписей.Отбор.ВидСтавокЕСНиПФР.Значение = Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей;
		КонецЕсли;
		
		НаборЗаписей.Очистить();
		
		// до 280000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2005, Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 1,
		0,	280000, 20.0,	 3.2,	0.8,	2.0,// ФБ , ФСС, ФФОМС, ТФОМС	
		0.0,	 4.0,		// Накопительная часть ПФР по возрастам 
		14.0,	10.0);		// Страховая часть ПФР по возрастам
		
		// до 600000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2005, Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 2, 
		280000, 600000,  7.9,   1.1,	0.5,	0.5,// ФБ , ФСС, ФФОМС, ТФОМС	 
		0.0,	1.6,		// Накопительная часть ПФР по возрастам 
		5.5, 	3.9);		// Страховая часть ПФР по возрастам
		
		// свыше 6000000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2005,  Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 3,
		600000,9999999999,2);	// ФБ 	
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Записать();
		КонецЕсли;		
	
	КонецЕсли;		
	
	Если ЗаполнитьВсе или (Год = 2005 и ВидыСтавок = Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей) Тогда
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Отбор.Год.Значение = 2005;
			НаборЗаписей.Отбор.ВидСтавокЕСНиПФР.Значение = Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей;
		КонецЕсли;
		НаборЗаписей.Очистить();
		
		// до 280000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2005, Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 1,
		0,	280000, 15.8,	 2.2,	0.8,	1.2,// ФБ , ФСС, ФФОМС, ТФОМС	
		0.0,	 4.0,		// Накопительная часть ПФР по возрастам 
		10.3,	 6.3);		// Страховая часть ПФР по возрастам
		
		// до 600000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2005, Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 2, 
		280000, 600000,  7.9,   1.1,	0.4,	0.6,// ФБ , ФСС, ФФОМС, ТФОМС	 
		0.0,	1.6,		// Накопительная часть ПФР по возрастам 
		5.5, 	3.9);		// Страховая часть ПФР по возрастам
		
		// свыше 6000000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2005,  Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 3,
		600000,9999999999,2);	// ФБ 	
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	// ----------------------------------------------------------------------------
	// 2006 год  
	
	Если ЗаполнитьВсе или (Год = 2006 и ВидыСтавок = Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей) Тогда
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Отбор.Год.Значение = 2006;
			НаборЗаписей.Отбор.ВидСтавокЕСНиПФР.Значение = Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей;
		КонецЕсли;
		НаборЗаписей.Очистить();
		
		// до 280000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2006, Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 1,
		0,	280000, 20.0,	 2.9,	1.1,	2.0,// ФБ , ФСС, ФФОМС, ТФОМС	
		0.0,	 4.0,		// Накопительная часть ПФР по возрастам 
		14.0,	10.0);		// Страховая часть ПФР по возрастам
		
		// до 600000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2006, Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 2, 
		280000, 600000,  7.9,   1.0,	0.6,	0.5,// ФБ , ФСС, ФФОМС, ТФОМС	 
		0.0,	1.6,		// Накопительная часть ПФР по возрастам 
		5.5, 	3.9);		// Страховая часть ПФР по возрастам
		
		// свыше 6000000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2006,  Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 3,
		600000,9999999999,2);	// ФБ 	
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаполнитьВсе или (Год = 2006 и ВидыСтавок = Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей) Тогда
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Отбор.Год.Значение = 2006;
			НаборЗаписей.Отбор.ВидСтавокЕСНиПФР.Значение = Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей;
		КонецЕсли;
		НаборЗаписей.Очистить();
		
		// до 280000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2006, Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 1,
		0,	280000, 15.8,	 1.9,	1.1,	1.2,// ФБ , ФСС, ФФОМС, ТФОМС	
		0.0,	 4.0,		// Накопительная часть ПФР по возрастам 
		10.3,	 6.3);		// Страховая часть ПФР по возрастам
		
		// до 600000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2006, Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 2, 
		280000, 600000,  7.9,   0.9,	0.6,	0.6,// ФБ , ФСС, ФФОМС, ТФОМС	 
		0.0,	1.6,		// Накопительная часть ПФР по возрастам 
		5.5, 	3.9);		// Страховая часть ПФР по возрастам
		
		// свыше 6000000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2006,  Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 3,
		600000,9999999999,2);	// ФБ 	
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	// ----------------------------------------------------------------------------
	// 2007 год 
	
	Если ЗаполнитьВсе или (Год = 2007 и ВидыСтавок = Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей) Тогда
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Отбор.Год.Значение = 2007;
			НаборЗаписей.Отбор.ВидСтавокЕСНиПФР.Значение = Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей;
		КонецЕсли;
		НаборЗаписей.Очистить();
		
		// до 280000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2007, Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 1,
		0,	280000, 20.0,	 2.9,	1.1,	2.0,// ФБ , ФСС, ФФОМС, ТФОМС	
		0.0,	 4.0,		// Накопительная часть ПФР по возрастам 
		14.0,	10.0);		// Страховая часть ПФР по возрастам
		
		// до 600000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2007, Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 2, 
		280000, 600000,  7.9,   1.0,	0.6,	0.5,// ФБ , ФСС, ФФОМС, ТФОМС	 
		0.0,	1.6,		// Накопительная часть ПФР по возрастам 
		5.5, 	3.9);		// Страховая часть ПФР по возрастам
		
		// свыше 6000000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2007,  Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 3,
		600000,9999999999,2);	// ФБ 	
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаполнитьВсе или (Год = 2007 и ВидыСтавок = Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей) Тогда
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Отбор.Год.Значение = 2007;
			НаборЗаписей.Отбор.ВидСтавокЕСНиПФР.Значение = Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей;
		КонецЕсли;
		НаборЗаписей.Очистить();
		
		// до 280000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2007, Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 1,
		0,	280000, 15.8,	 1.9,	1.1,	1.2,// ФБ , ФСС, ФФОМС, ТФОМС	
		0.0,	 4.0,		// Накопительная часть ПФР по возрастам 
		10.3,	 6.3);		// Страховая часть ПФР по возрастам
		
		// до 600000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2007, Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 2, 
		280000, 600000,  7.9,   0.9,	0.6,	0.6,// ФБ , ФСС, ФФОМС, ТФОМС	 
		0.0,	1.6,		// Накопительная часть ПФР по возрастам 
		5.5, 	3.9);		// Страховая часть ПФР по возрастам
		
		// свыше 6000000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2007,  Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 3,
		600000,9999999999,2);	// ФБ 	
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	// ----------------------------------------------------------------------------
	// 2008 год 
	
	Если ЗаполнитьВсе или (Год = 2008 и ВидыСтавок = Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей) Тогда
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Отбор.Год.Значение = 2008;
			НаборЗаписей.Отбор.ВидСтавокЕСНиПФР.Значение = Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей;
		КонецЕсли;
		НаборЗаписей.Очистить();
		
		// до 280000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2008, Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 1,
		0,	280000, 20.0,	 2.9,	1.1,	2.0,// ФБ , ФСС, ФФОМС, ТФОМС	
		0.0,	 6.0,		// Накопительная часть ПФР по возрастам 
		14.0,	 8.0);		// Страховая часть ПФР по возрастам
		
		// до 600000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2008, Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 2, 
		280000, 600000,  7.9,   1.0,	0.6,	0.5,// ФБ , ФСС, ФФОМС, ТФОМС	 
		0.0,	2.4,		// Накопительная часть ПФР по возрастам 
		5.5, 	3.1);		// Страховая часть ПФР по возрастам
		
		// свыше 6000000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2008,  Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 3,
		600000,9999999999,2);	// ФБ 	
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаполнитьВсе или (Год = 2008 и ВидыСтавок = Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей) Тогда
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Отбор.Год.Значение = 2008;
			НаборЗаписей.Отбор.ВидСтавокЕСНиПФР.Значение = Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей;
		КонецЕсли;
		НаборЗаписей.Очистить();
		
		// до 280000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2008, Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 1,
		0,	280000, 15.8,	 1.9,	1.1,	1.2,// ФБ , ФСС, ФФОМС, ТФОМС	
		0.0,	 6.0,		// Накопительная часть ПФР по возрастам 
		10.3,	 4.3);		// Страховая часть ПФР по возрастам
		
		// до 600000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2008, Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 2, 
		280000, 600000,  7.9,   0.9,	0.6,	0.6,// ФБ , ФСС, ФФОМС, ТФОМС	 
		0.0,	2.4,		// Накопительная часть ПФР по возрастам 
		5.5, 	3.1);		// Страховая часть ПФР по возрастам
		
		// свыше 6000000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2008,  Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 3,
		600000,9999999999,2);	// ФБ 	
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;

	// ----------------------------------------------------------------------------
	// 2009 год 
	
	Если ЗаполнитьВсе или (Год >= 2009 и ВидыСтавок = Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей) Тогда
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Отбор.Год.Значение = 2009;
			НаборЗаписей.Отбор.ВидСтавокЕСНиПФР.Значение = Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей;
		КонецЕсли;
		НаборЗаписей.Очистить();
		
		// до 280000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2009, Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 1,
		0,	280000, 20.0,	 2.9,	1.1,	2.0,// ФБ , ФСС, ФФОМС, ТФОМС	
		0.0,	 6.0,		// Накопительная часть ПФР по возрастам 
		14.0,	 8.0);		// Страховая часть ПФР по возрастам
		
		// до 600000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2009, Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 2, 
		280000, 600000,  7.9,   1.0,	0.6,	0.5,// ФБ , ФСС, ФФОМС, ТФОМС	 
		0.0,	2.4,		// Накопительная часть ПФР по возрастам 
		5.5, 	3.1);		// Страховая часть ПФР по возрастам
		
		// свыше 6000000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2009,  Перечисления.ВидыСтавокЕСНиПФР.ДляНеСельскохозяйственныхПроизводителей, 3,
		600000,9999999999,2);	// ФБ 	
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаполнитьВсе или (Год >= 2009 и ВидыСтавок = Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей) Тогда
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Отбор.Год.Значение = 2009;
			НаборЗаписей.Отбор.ВидСтавокЕСНиПФР.Значение = Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей;
		КонецЕсли;
		НаборЗаписей.Очистить();
		
		// до 280000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2009, Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 1,
		0,	280000, 15.8,	 1.9,	1.1,	1.2,// ФБ , ФСС, ФФОМС, ТФОМС	
		0.0,	 6.0,		// Накопительная часть ПФР по возрастам 
		10.3,	 4.3);		// Страховая часть ПФР по возрастам
		
		// до 600000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2009, Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 2, 
		280000, 600000,  7.9,   0.9,	0.6,	0.6,// ФБ , ФСС, ФФОМС, ТФОМС	 
		0.0,	2.4,		// Накопительная часть ПФР по возрастам 
		5.5, 	3.1);		// Страховая часть ПФР по возрастам
		
		// свыше 6000000
		ДобавитьЗначенияСтавокЕСН(НаборЗаписей, 2009,  Перечисления.ВидыСтавокЕСНиПФР.ДляСельскохозяйственныхПроизводителей, 3,
		600000,9999999999,2);	// ФБ 	
		
		Если ЗаполнитьВсе Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
